pokeportal/app/controllers/pokemon_controller.rb

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "pokemons" SET "trainer_id" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["trainer_id", 5], ["updated_at", "2018-10-26 23:34:04.044320"], ["id", 2]]
---
	def capture
 		Pokemon.find(params[:id]).update(trainer: current_trainer)

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "pokemons" WHERE "pokemons"."id" = ?  [["id", 1]]
UPDATE "pokemons" SET "Health" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["Health", 90], ["updated_at", "2018-10-28 05:03:21.847265"], ["id", 1]]
---
	def damage
		pokeHealth = Pokemon.find(params[:id]).Health - 10
		if pokeHealth <= 0
			# Delete the Pokemon
			nil
			Pokemon.destroy(Pokemon.find(params[:id]).id)
		else
			Pokemon.find(params[:id]).update(Health: pokeHealth)

INSERT INTO "pokemons" ("name", "level", "trainer_id", "created_at", "updated_at", "Health") VALUES (?, ?, ?, ?, ?, ?)  [["name", "lol"], ["level", 1], ["trainer_id", 5], ["created_at", "2018-10-30 22:30:27.858929"], ["updated_at", "2018-10-30 22:30:27.858929"], ["Health", 100]]
---
	def create
		@pokemon = Pokemon.new
		@pokemon.name = params[:pokemon][:name]
		@pokemon.level = 1
		@pokemon.Health = 100
		@pokemon.trainer = current_trainer
		if @pokemon.save