pokeportal/app/views/trainers/show.html.erb

<p>Email: <%= @trainer.email if @trainer.email %></p>
<% Pokemon.where(trainer: current_trainer).each do |poke|  %>
---
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."trainer_id" = ?  [["trainer_id", 5]]